app/controllers/comments_controller.rb

  def create
    @post = Post.find(params[:post_id])
    @post.comments.create(comment_params)
---
SELECT  `posts`.* FROM `posts` WHERE `posts`.`id` = 7 LIMIT 1
INSERT INTO `comments` (`body`, `post_id`, `created_at`, `updated_at`) VALUES ('new comment', 7, '2017-10-26 01:46:22', '2017-10-26 01:46:22')

  def destroy
    @post = Post.find(params[:post_id])
    @comment = @post.comments.find(params[:id])
    @comment.destroy
---
SELECT  `posts`.* FROM `posts` WHERE `posts`.`id` = 7 LIMIT 1
SELECT  `comments`.* FROM `comments` WHERE `comments`.`post_id` = 7 AND `comments`.`id` = 1 LIMIT 1
DELETE FROM `comments` WHERE `comments`.`id` = 1