app/controllers/posts_controller.rb

SELECT `posts`.* FROM `posts` ORDER BY `posts`.`created_at` DESC
---
  def index
    @posts = Post.all.order(created_at: 'desc')

INSERT INTO `posts` (`title`, `body`, `created_at`, `updated_at`) VALUES ('a', 'b', '2017-10-26 00:57:30', '2017-10-26 00:57:30')
---
  def create
    @post = Post.new(post_params)
    if @post.save

SELECT  `posts`.* FROM `posts` WHERE `posts`.`id` = 7 LIMIT 1
UPDATE `posts` SET `title` = 'aaa updated', `body` = 'aaa\r\nupdated', `updated_at` = '2017-10-26 01:16:46' WHERE `posts`.`id` = 7
---
  def update
    @post = Post.find(params[:id])
    if @post.update(post_params)

SELECT  `posts`.* FROM `posts` WHERE `posts`.`id` = 8 LIMIT 1
DELETE FROM `posts` WHERE `posts`.`id` = 8
---
  def destroy
    @post = Post.find(params[:id])
    @post.destroy